//
//  AVMeaningShortWords.m
//  Dictionary@2
//
//  Created by Anatoly Ryavkin on 01/11/2019.
//  Copyright © 2019 AnatolyRyavkin. All rights reserved.
//

#import "AVMeaningShortWords.h"

@implementation AVMeaningShortWords

+(id)sharedShortWords{
    static AVMeaningShortWords*shortWords = nil;
    if(!shortWords){
        shortWords = [[AVMeaningShortWords alloc]init];

        shortWords.arrayEngPredlog = @[@"of",@"with",@"the",@"from",@"in",@"by",@"that",@"about",@"for",@"against",@"upon",@"out of",@"a",@"at",@"over",@"towards",@"the",@"on",@"to",@"up",@"out",@"between",@"through"];

//                    shortWords.arrayShortWordGrammatic = @[
//                                                           @"adj",
//                                                           @"adv",
//                                                           @"attr",
//                                                           @"cj",
//                                                           @"compar",
//                                                           @"emph",
//                                                           @"imp",
//                                                           @"int",
//                                                           @"n",
//                                                           @"num",
//                                                           @"part",
//                                                           @"pass",
//                                                           @"pl",
//                                                           @"pp",
//                                                           @"predic",
//                                                           @"pref",
//                                                           @"prep",
//                                                           @"pres_p",
//                                                           @"pron",
//                                                           @"refl",
//                                                           @"sg",
//                                                           @"smb",
//                                                           @"smth",
//                                                           @"suff",
//                                                           @"superl",
//                                                           @"v",
//                                                           @"along",
//                                                           @"over"
//                                                           ];


        shortWords.arrayShortWordGrammaticProperty = @[
                                               @"adj",
                                               @"adv",
                                               @"cj",
                                               @"int",
                                               @"n",
                                               @"num",
                                               @"pl",  //xz!!!
                                               @"predic",
                                               @"pref",
                                               @"prep",
                                               @"pron",
                                               @"refl",
                                               @"suff",
                                               @"v"
                                               ];


//        shortWords.arrayLongWordGrammaticProperty = @[
//                                              @"adjective",
//                                              @"adverb",
//                                              @"conjunction",
//                                              @"interjection",
//                                              @"noun",
//                                              @"numeral",
//                                              @"plural",
//                                              @"predicative",
//                                              @"prefix",
//                                              @"preposition",
//                                              @"pronoun",
//                                              @"reflexive",
//                                              @"suffix",
//                                              @"verb"
//                                              ];
//
//        shortWords.arrayMeaningWordGrammaticProperty = @[
//                                                 @"имя прилагательное",
//                                                 @"наречие",
//                                                 @"союз",
//                                                 @"междометие",
//                                                 @"имя существительное",
//                                                 @"числительное",
//                                                 @"множественное число",
//                                                 @"предикативное употребление",
//                                                 @"приставка",
//                                                 @"предлог",
//                                                 @"местоимение",
//                                                 @"употребляется с возвратным местоимением",
//                                                 @"суффикс",
//                                                 @"глагол"
//                                                 ];


        

//        shortWords.dictionaryKeyShortObjLongWordGrammaticProperty = [NSDictionary dictionaryWithObjects:shortWords.arrayLongWordGrammaticProperty forKeys:shortWords.arrayShortWordGrammaticProperty];
//        shortWords.dictionaryKeyShortObjMeaningWordGrammaticProperty = [NSDictionary dictionaryWithObjects:shortWords.arrayMeaningWordGrammaticProperty forKeys:shortWords.arrayShortWordGrammaticProperty];



//property rus in text, but dont clogers
        shortWords.arrayShortRusProperty = @[@"ав",
                                                  @"авт",
                                                  @"амер",
                                                  @"анат",
                                                  @"археол",
                                                  @"архит",
                                                  @"астр",
                                                  @"библ",
                                                  @"биол",
                                                  @"бот",
                                                  @"бухг",
                                                  @"воен",
                                                  @"возвыш",
                                                  @"вчт",
                                                  @"геогр",
                                                  @"геол",
                                                  @"геральд",
                                                  @"горн",
                                                  @"грам",
                                                  @"груб",
                                                  @"детск",
                                                  @"дип",
                                                  @"дор",
                                                  @"ж-д",
                                                  @"жив",
                                                  @"зоол",
                                                  @"ирон",
                                                  @"иск",
                                                  @"ист",
                                                  @"канад",
                                                  @"карт",
                                                  @"кино",
                                                  @"книжн",
                                                  @"ком",
                                                  @"косм",
                                                  @"кул",
                                                  @"ласк",
                                                  @"лат",
                                                  @"лингв",
                                                  @"лит",
                                                  @"лог",
                                                  @"мат",
                                                  @"мед",
                                                  @"метал",
                                                  @"метео",
                                                  @"мин",
                                                  @"миф",
                                                  @"мор",
                                                  @"муз",
                                                  @"опт",
                                                  @"охот",
                                                  @"парл",
                                                  @"перен",
                                                  @"полигр",
                                                  @"полит",
                                                  @"поэт",
                                                  @"презр",
                                                  @"пренебр",
                                                  @"психол",
                                                  @"радио",
                                                  @"разг",
                                                  @"редк",
                                                  @"рел",
                                                  @"собир",
                                                  @"сокр",
                                                  @"спец",
                                                  @"спорт",
                                                  @"стил",
                                                  @"стих",
                                                  @"стр",
                                                  @"с-х",
                                                  @"твор",
                                                  @"театр",
                                                  @"текст",
                                                  @"тех",
                                                  @"тлв",
                                                  @"унив",
                                                  @"уст",
                                                  @"фарм",
                                                  @"физ",
                                                  @"физиол",
                                                  @"филос",
                                                  @"фин",
                                                  @"фон",
                                                  @"фото",
                                                  @"фр",
                                                  @"хим",
                                                  @"хир",
                                                  @"церк",
                                                  @"шахм",
                                                  @"шутл",
                                                  @"эвф",
                                                  @"эк",
                                                  @"эл",
                                                  @"юр",
                                                  @"новозел",
                                                  @"шотл",
                                                  @"австрал"
                                              ];

    
//        shortWords.arrayLongRusProperty = @[
//                                                 @"авиация",
//                                                 @"автомобильное дело",
//                                                 @"американиз",
//                                                 @"анатомия",
//                                                 @"археология",
//                                                 @"архитектура",
//                                                 @"астрономия",
//                                                 @"банковский термин",
//                                                 @"без изменений",
//                                                 @"библеизм",
//                                                 @"биология",
//                                                 @"ботаника",
//                                                 @"бухгалтерия",
//                                                 @"военное дело",
//                                                 @"возвышенно",
//                                                 @"вопросительных",
//                                                 @"время",
//                                                 @"вычислительная техника",
//                                                 @"география",
//                                                 @"геодезия",
//                                                 @"геология",
//                                                 @"геометрия",
//                                                 @"геральдика",
//                                                 @"глагол",
//                                                 @"горное дело",
//                                                 @"грамматика",
//                                                 @"грубое слово, выражение",
//                                                 @"дюйм",
//                                                 @"детская речь",
//                                                 @"дипломатия",
//                                                 @"дорожное дело",
//                                                 @"другие",
//                                                 @"древнегреческий (-ая история)",
//                                                 @"древнееврейский (язык)",
//                                                 @"древнеримский (-ая история)",
//                                                 @"единственное число",
//                                                 @"женский род",
//                                                 @"железнодорожный транспорт",
//                                                 @"живопись",
//                                                 @"зоология",
//                                                 @"и прочее",
//                                                 @"в ироническом смысле, иронический",
//                                                 @"искусство",
//                                                 @"история",
//                                                 @"и тому подобное",
//                                                 @"употребительно в Канаде",
//                                                 @"канцелярское слово, выражение",
//                                                 @"термин карточной игры",
//                                                 @"кинематография",
//                                                 @"книжный стиль",
//                                                 @"коммерческий термин",
//                                                 @"космонавтика",
//                                                 @"кулинария",
//                                                 @"лицо",
//                                                 @"-либо:",
//                                                 @"ласкательная форма",
//                                                 @"латинский (язык)",
//                                                 @"лесное дело",
//                                                 @"лингвистика",
//                                                 @"литература, литературоведение",
//                                                 @"логика",
//                                                 @"мужской род",
//                                                 @"математика",
//                                                 @"медицина",
//                                                 @"металлургия",
//                                                 @"метеорология",
//                                                 @"механика",
//                                                 @"минералогия",
//                                                 @"мифология",
//                                                 @"множественное число",
//                                                 @"морской термин",
//                                                 @"музыка",
//                                                 @"наречие",
//                                                 @"неизменяемая форма",
//                                                 @"неодобрительно",
//                                                 @"остров",
//                                                 @"обыкновенно",
//                                                 @"оптика",
//                                                 @"особенно",
//                                                 @"отрицательных",
//                                                 @"охота",
//                                                 @"падеж",
//                                                 @"парламентское выражение",
//                                                 @"в переносном значении",
//                                                 @"полуостров",
//                                                 @"полиграфия",
//                                                 @"политический термин",
//                                                 @"пословица",
//                                                 @"поэтическое слово, выражение",
//                                                 @"превосходная степень",
//                                                 @"предложение",
//                                                 @"презрительно",
//                                                 @"преимущественно",
//                                                 @"пренебрежительно",
//                                                 @"приблизительно",
//                                                 @"имя прилагательное",
//                                                 @"психология",
//                                                 @"радиотехника",
//                                                 @"разговорное слово, выражение",
//                                                 @"в распространенном, неточном значении",
//                                                 @"редко",
//                                                 @"религия",
//                                                 @"смотри",
//                                                 @"собирательно",
//                                                 @"сокращение, сокращенно",
//                                                 @"специальный термин",
//                                                 @"физкультура и спорт",
//                                                 @"сравни",
//                                                 @"сравнительная степень",
//                                                 @"статистика",
//                                                 @"стилистика",
//                                                 @"стихосложение",
//                                                 @"строительное дело",
//                                                 @"студенческое слово, выражение",
//                                                 @"имя существительное",
//                                                 @"сельское хозяйство",
//                                                 @"творительный (падеж)",
//                                                 @"театральный термин",
//                                                 @"текстильное дело",
//                                                 @"техника",
//                                                 @"также",
//                                                 @"только",
//                                                 @"телевидение",
//                                                 @"топография",
//                                                 @"университетское выражение",
//                                                 @"употребляется",
//                                                 @"устаревшее слово, выражение",
//                                                 @"утвердительных",
//                                                 @"фармакология",
//                                                 @"физика",
//                                                 @"физиология",
//                                                 @"философия",
//                                                 @"финансовый термин",
//                                                 @"фонетика",
//                                                 @"фотография",
//                                                 @"французский (язык)",
//                                                 @"химия",
//                                                 @"хирургия",
//                                                 @"церковное слово, выражение",
//                                                 @"шахматы",
//                                                 @"шутливое слово, выражение",
//                                                 @"эвфемизм",
//                                                 @"экономика",
//                                                 @"электротехника",
//                                                 @"электроника",
//                                                 @"этнография",
//                                                 @"юридический термин",
//                                                 @"новозеланд",
//                                                 @"атрибутивно",
//                                                 @"новозеландский",
//                                                 @"шотландский"
//                                                ];
//
//        //shortWords.dictionaryRusKeyShortObjLongProperty = [NSDictionary dictionaryWithObjects:shortWords.arrayLongRusProperty forKeys:shortWords.arrayShortRusProperty];
//
//        shortWords.arrayShortRusReduct = @[@"ав",
//                                           @"авт",
//                                           @"амер",
//                                           @"анат",
//                                           @"археол",
//                                           @"архит",
//                                           @"астр",
//                                           @"библ",
//                                           @"биол",
//                                           @"бот",
//                                           @"бухг",
//                                           @"воен",
//                                           @"возвыш",
//                                           @"вопр",
//                                           @"вр",
//                                           @"вчт",
//                                           @"геогр",
//                                           @"геод",
//                                           @"геол",
//                                           @"геом",
//                                           @"геральд",
//                                           @"гл",
//                                           @"горн",
//                                           @"грам",
//                                           @"груб",
//                                           @"д",
//                                           @"детск",
//                                           @"дип",
//                                           @"дор",
//                                           @"др-греч (ucm)",
//                                           @"др-евр",
//                                           @"др-рим (ист)",
//                                           @"ед ч",
//                                           @"ж-д",
//                                           @"жив",
//                                           @"зоол",
//                                           @"и пр",
//                                           @"ирон",
//                                           @"иск",
//                                           @"ист",
//                                           @"и т п",
//                                           @"канад",
//                                           @"канц",
//                                           @"карт",
//                                           @"кино",
//                                           @"книжн",
//                                           @"ком",
//                                           @"косм",
//                                           @"кул",
//                                           @"ласк",
//                                           @"лат",
//                                           @"лингв",
//                                           @"лит",
//                                           @"лог",
//                                           @"м",
//                                           @"мат",
//                                           @"мед",
//                                           @"метал",
//                                           @"метео",
//                                           @"мех",
//                                           @"мин",
//                                           @"миф",
//                                           @"мн ч",
//                                           @"мор",
//                                           @"муз",
//                                           @"нареч",
//                                           @"неизм",
//                                           @"неодобр",
//                                           @"обыкн",
//                                           @"опт",
//                                           @"особ",
//                                           @"отриц",
//                                           @"охот",
//                                           @"парл",
//                                           @"перен",
//                                           @"п-ов",
//                                           @"полигр",
//                                           @"полит",
//                                           @"посл",
//                                           @"поэт",
//                                           @"превосх ст",
//                                           @"предл",
//                                           @"презр",
//                                           @"преим",
//                                           @"пренебр",
//                                           @"прибл",
//                                           @"психол",
//                                           @"радио",
//                                           @"разг",
//                                           @"распр",
//                                           @"редк",
//                                           @"рел",
//                                           @"см",
//                                           @"собир",
//                                           @"сокр",
//                                           @"спец",
//                                           @"спорт",
//                                           @"ср",
//                                           @"сравн ст",
//                                           @"стат",
//                                           @"стил",
//                                           @"стих",
//                                           @"стр",
//                                           @"студ",
//                                           @"с-х",
//                                           @"твор",
//                                           @"театр",
//                                           @"текст",
//                                           @"тех",
//                                           @"тж",
//                                           @"тк",
//                                           @"тлв",
//                                           @"топ",
//                                           @"унив",
//                                           @"уст",
//                                           @"утв",
//                                           @"фарм",
//                                           @"физ",
//                                           @"физиол",
//                                           @"филос",
//                                           @"фин",
//                                           @"фон",
//                                           @"фото",
//                                           @"фр",
//                                           @"хим",
//                                           @"хир",
//                                           @"церк",
//                                           @"шахм",
//                                           @"шутл",
//                                           @"эвф",
//                                           @"эк",
//                                           @"эл",
//                                           @"элн",
//                                           @"этн",
//                                           @"юр",
//                                           @"новозел",
//                                           @"атриб",
//                                           @"новозел",
//                                           @"шотл"
//                                           ];
//
//        shortWords.arrayLongRusReduct = @[
//                                            @"авиация",
//                                            @"автомобильное дело",
//                                            @"американиз",
//                                            @"анатомия",
//                                            @"археология",
//                                            @"архитектура",
//                                            @"астрономия",
//                                            @"банковский термин",
//                                            @"без изменений",
//                                            @"библеизм",
//                                            @"биология",
//                                            @"ботаника",
//                                            @"бухгалтерия",
//                                            @"военное дело",
//                                            @"возвышенно",
//                                            @"вопросительный",
//                                            @"время",
//                                            @"вычислительная техника",
//                                            @"география",
//                                            @"геодезия",
//                                            @"геология",
//                                            @"геометрия",
//                                            @"геральдика",
//                                            @"глагол",
//                                            @"горное дело",
//                                            @"грамматика",
//                                            @"грубое слово, выражение",
//                                            @"дюйм",
//                                            @"детская речь",
//                                            @"дипломатия",
//                                            @"дорожное дело",
//                                            @"другие",
//                                            @"древнегреческий (-ая история)",
//                                            @"древнееврейский (язык)",
//                                            @"древнеримский (-ая история)",
//                                            @"единственное число",
//                                            @"женский род",
//                                            @"железнодорожный транспорт",
//                                            @"живопись",
//                                            @"зоология",
//                                            @"и прочее",
//                                            @"в ироническом смысле, иронический",
//                                            @"искусство",
//                                            @"история",
//                                            @"и тому подобное",
//                                            @"употребительно в Канаде",
//                                            @"канцелярское слово, выражение",
//                                            @"термин карточной игры",
//                                            @"кинематография",
//                                            @"книжный стиль",
//                                            @"коммерческий термин",
//                                            @"космонавтика",
//                                            @"кулинария",
//                                            @"лицо",
//                                            @"-либо:",
//                                            @"ласкательная форма",
//                                            @"латинский (язык)",
//                                            @"лесное дело",
//                                            @"лингвистика",
//                                            @"литература, литературоведение",
//                                            @"логика",
//                                            @"мужской род",
//                                            @"математика",
//                                            @"медицина",
//                                            @"металлургия",
//                                            @"метеорология",
//                                            @"механика",
//                                            @"минералогия",
//                                            @"мифология",
//                                            @"множественное число",
//                                            @"морской термин",
//                                            @"музыка",
//                                            @"наречие",
//                                            @"неизменяемая форма",
//                                            @"неодобрительно",
//                                            @"остров",
//                                            @"обыкновенно",
//                                            @"оптика",
//                                            @"особенно",
//                                            @"отрицательный",
//                                            @"охота",
//                                            @"падеж",
//                                            @"парламентское выражение",
//                                            @"в переносном значении",
//                                            @"полуостров",
//                                            @"полиграфия",
//                                            @"политический термин",
//                                            @"пословица",
//                                            @"поэтическое слово, выражение",
//                                            @"превосходная степень",
//                                            @"предложение",
//                                            @"презрительно",
//                                            @"преимущественно",
//                                            @"пренебрежительно",
//                                            @"приблизительно",
//                                            @"имя прилагательное",
//                                            @"психология",
//                                            @"радиотехника",
//                                            @"разговорное слово, выражение",
//                                            @"в распространенном, неточном значении",
//                                            @"редко",
//                                            @"религия",
//                                            @"смотри",
//                                            @"собирательно",
//                                            @"сокращение, сокращенно",
//                                            @"специальный термин",
//                                            @"физкультура и спорт",
//                                            @"сравни",
//                                            @"сравнительная степень",
//                                            @"статистика",
//                                            @"стилистика",
//                                            @"стихосложение",
//                                            @"строительное дело",
//                                            @"студенческое слово, выражение",
//                                            @"имя существительное",
//                                            @"сельское хозяйство",
//                                            @"творительный (падеж)",
//                                            @"театральный термин",
//                                            @"текстильное дело",
//                                            @"техника",
//                                            @"также",
//                                            @"только",
//                                            @"телевидение",
//                                            @"топография",
//                                            @"университетское выражение",
//                                            @"употребляется",
//                                            @"устаревшее слово, выражение",
//                                            @"утвердительный",
//                                            @"фармакология",
//                                            @"физика",
//                                            @"физиология",
//                                            @"философия",
//                                            @"финансовый термин",
//                                            @"фонетика",
//                                            @"фотография",
//                                            @"французский (язык)",
//                                            @"химия",
//                                            @"хирургия",
//                                            @"церковное слово, выражение",
//                                            @"шахматы",
//                                            @"шутливое слово, выражение",
//                                            @"эвфемизм",
//                                            @"экономика",
//                                            @"электротехника",
//                                            @"электроника",
//                                            @"этнография",
//                                            @"юридический термин",
//                                            @"новозеланд"
//                                            ];

        //shortWords.dictionaryRusKeyShortObjLongReduct = [NSDictionary dictionaryWithObjects:shortWords.arrayLongRusReduct forKeys:shortWords.arrayShortRusReduct];


    }
    return shortWords;
}

@end

    //        shortWords.arrayShortWordGrammatic = @[
    //                                               @"adj",
    //                                               @"adv",
    //                                               @"attr",
    //                                               @"cj",
    //                                               @"compar",
    //                                               @"emph",
    //                                               @"imp",
    //                                               @"int",
    //                                               @"n",
    //                                               @"num",
    //                                               @"part",
    //                                               @"pass",
    //                                               @"pl",
    //                                               @"pp",
    //                                               @"predic",
    //                                               @"pref",
    //                                               @"prep",
    //                                               @"pres_p",
    //                                               @"pron",
    //                                               @"refl",
    //                                               @"sg",
    //                                               @"smb",
    //                                               @"smth",
    //                                               @"suff",
    //                                               @"superl",
    //                                               @"v"
    //                                               ];
    //
    //        shortWords.arrayLongWordGrammatic = @[
    //                                               @"adjective",
    //                                               @"adverb",
    //                                               @"attributive",
    //                                               @"conjunction",
    //                                               @"comparative",
    //                                               @"emphatic (pronoun)",
    //                                               @"imperative",
    //                                               @"interjection",
    //                                               @"noun",
    //                                               @"numeral",
    //                                               @"particle",
    //                                               @"passive",
    //                                               @"plural",
    //                                               @"past participle",
    //                                               @"predicative",
    //                                               @"prefix",
    //                                               @"preposition",
    //                                               @"present participle",
    //                                               @"pronoun",
    //                                               @"reflexive",
    //                                               @"singular",
    //                                               @"somebody",
    //                                               @"something",
    //                                               @"suffix",
    //                                               @"superlative",
    //                                               @"verb"
    //                                               ];
    //
    //        shortWords.arrayMeaningWordGrammatic = @[
    //                                               @"имя прилагательное",
    //                                               @"наречие",
    //                                               @"атрибутивное употребление",
    //                                               @"союз",
    //                                               @"сравнительная степень",
    //                                               @"усилительное (местоимение)",
    //                                               @"повелительное (наклонение)",
    //                                               @"междометие",
    //                                               @"имя существительное",
    //                                               @"числительное",
    //                                               @"частица",
    //                                               @"страдательный (залог)",
    //                                               @"множественное число",
    //                                               @"причастие прошедшего времени",
    //                                               @"предикативное употребление",
    //                                               @"приставка",
    //                                               @"предлог",
    //                                               @"причастие настоящего времени",
    //                                               @"местоимение",
    //                                               @"употребляется с возвратным местоимением",
    //                                               @"единственное число",
    //                                               @"кто-либо",
    //                                               @"что-либо",
    //                                               @"суффикс",
    //                                               @"превосходная степень",
    //                                               @"глагол"
    //                                               ];

    //
    //shortWords.arrayShortRusProperty = @[@"ав",
    //                                     @"авт",
    //                                     @"амер",
    //                                     @"анат",
    //                                     @"археол",
    //                                     @"архит",
    //                                     @"астр",
    //                                     @"банк",
    //                                     @"без измен",
    //                                     @"библ",
    //                                     @"биол",
    //                                     @"бот",
    //                                     @"бухг",
    //                                     @"воен",
    //                                     @"возвыш",
    //                                     @"вопр",
    //                                     @"вр",
    //                                     @"вчт",
    //                                     @"геогр",
    //                                     @"геод",
    //                                     @"геол",
    //                                     @"геом",
    //                                     @"геральд",
    //                                     @"гл",
    //                                     @"горн",
    //                                     @"грам",
    //                                     @"груб",
    //                                     @"д",
    //                                     @"детск",
    //                                     @"дип",
    //                                     @"дор",
    //                                     @"др",
    //                                     @"др-греч (ucm)",
    //                                     @"др-евр",
    //                                     @"др-рим (ист)",
    //                                     @"ед ч",
    //                                     @"ж",
    //                                     @"ж-д",
    //                                     @"жив",
    //                                     @"зоол",
    //                                     @"и пр",
    //                                     @"ирон",
    //                                     @"иск",
    //                                     @"ист",
    //                                     @"и т п",
    //                                     @"канад",
    //                                     @"канц",
    //                                     @"карт",
    //                                     @"кино",
    //                                     @"книжн",
    //                                     @"ком",
    //                                     @"косм",
    //                                     @"кул",
    //                                     @"л",
    //                                     @"-л",
    //                                     @"ласк",
    //                                     @"лат",
    //                                     @"лес",
    //                                     @"лингв",
    //                                     @"лит",
    //                                     @"лог",
    //                                     @"м",
    //                                     @"мат",
    //                                     @"мед",
    //                                     @"метал",
    //                                     @"метео",
    //                                     @"мех",
    //                                     @"мин",
    //                                     @"миф",
    //                                     @"мн ч",
    //                                     @"мор",
    //                                     @"муз",
    //                                     @"нареч",
    //                                     @"неизм",
    //                                     @"неодобр",
    //                                     @"о",
    //                                     @"обыкн",
    //                                     @"опт",
    //                                     @"особ",
    //                                     @"отриц",
    //                                     @"охот",
    //                                     @"п",
    //                                     @"парл",
    //                                     @"перен",
    //                                     @"п-ов",
    //                                     @"полигр",
    //                                     @"полит",
    //                                     @"посл",
    //                                     @"поэт",
    //                                     @"превосх ст",
    //                                     @"предл",
    //                                     @"презр",
    //                                     @"преим",
    //                                     @"пренебр",
    //                                     @"прибл",
    //                                     @"прил",
    //                                     @"психол",
    //                                     @"радио",
    //                                     @"разг",
    //                                     @"распр",
    //                                     @"редк",
    //                                     @"рел",
    //                                     @"см",
    //                                     @"собир",
    //                                     @"сокр",
    //                                     @"спец",
    //                                     @"спорт",
    //                                     @"ср",
    //                                     @"сравн ст",
    //                                     @"стат",
    //                                     @"стил",
    //                                     @"стих",
    //                                     @"стр",
    //                                     @"студ",
    //                                     @"сущ",
    //                                     @"с-х",
    //                                     @"твор",
    //                                     @"театр",
    //                                     @"текст",
    //                                     @"тех",
    //                                     @"тж",
    //                                     @"тк",
    //                                     @"тлв",
    //                                     @"топ",
    //                                     @"унив",
    //                                     @"употр",
    //                                     @"уст",
    //                                     @"утв",
    //                                     @"фарм",
    //                                     @"физ",
    //                                     @"физиол",
    //                                     @"филос",
    //                                     @"фин",
    //                                     @"фон",
    //                                     @"фото",
    //                                     @"фр",
    //                                     @"хим",
    //                                     @"хир",
    //                                     @"церк",
    //                                     @"шахм",
    //                                     @"шутл",
    //                                     @"эвф",
    //                                     @"эк",
    //                                     @"эл",
    //                                     @"элн",
    //                                     @"этн",
    //                                     @"юр",
    //                                     @"новозел"
    //                                     ];
    //
    //shortWords.arrayLongRusProperty = @[
    //                                    @"авиация",
    //                                    @"автомобильное дело",
    //                                    @"американиз",
    //                                    @"анатомия",
    //                                    @"археология",
    //                                    @"архитектура",
    //                                    @"астрономия",
    //                                    @"банковский термин",
    //                                    @"без изменений",
    //                                    @"библеизм",
    //                                    @"биология",
    //                                    @"ботаника",
    //                                    @"бухгалтерия",
    //                                    @"военное дело",
    //                                    @"возвышенно",
    //                                    @"вопросительный",
    //                                    @"время",
    //                                    @"вычислительная техника",
    //                                    @"география",
    //                                    @"геодезия",
    //                                    @"геология",
    //                                    @"геометрия",
    //                                    @"геральдика",
    //                                    @"глагол",
    //                                    @"горное дело",
    //                                    @"грамматика",
    //                                    @"грубое слово, выражение",
    //                                    @"дюйм",
    //                                    @"детская речь",
    //                                    @"дипломатия",
    //                                    @"дорожное дело",
    //                                    @"другие",
    //                                    @"древнегреческий (-ая история)",
    //                                    @"древнееврейский (язык)",
    //                                    @"древнеримский (-ая история)",
    //                                    @"единственное число",
    //                                    @"женский род",
    //                                    @"железнодорожный транспорт",
    //                                    @"живопись",
    //                                    @"зоология",
    //                                    @"и прочее",
    //                                    @"в ироническом смысле, иронический",
    //                                    @"искусство",
    //                                    @"история",
    //                                    @"и тому подобное",
    //                                    @"употребительно в Канаде",
    //                                    @"канцелярское слово, выражение",
    //                                    @"термин карточной игры",
    //                                    @"кинематография",
    //                                    @"книжный стиль",
    //                                    @"коммерческий термин",
    //                                    @"космонавтика",
    //                                    @"кулинария",
    //                                    @"лицо",
    //                                    @"-либо:",
    //                                    @"ласкательная форма",
    //                                    @"латинский (язык)",
    //                                    @"лесное дело",
    //                                    @"лингвистика",
    //                                    @"литература, литературоведение",
    //                                    @"логика",
    //                                    @"мужской род",
    //                                    @"математика",
    //                                    @"медицина",
    //                                    @"металлургия",
    //                                    @"метеорология",
    //                                    @"механика",
    //                                    @"минералогия",
    //                                    @"мифология",
    //                                    @"множественное число",
    //                                    @"морской термин",
    //                                    @"музыка",
    //                                    @"наречие",
    //                                    @"неизменяемая форма",
    //                                    @"неодобрительно",
    //                                    @"остров",
    //                                    @"обыкновенно",
    //                                    @"оптика",
    //                                    @"особенно",
    //                                    @"отрицательный",
    //                                    @"охота",
    //                                    @"падеж",
    //                                    @"парламентское выражение",
    //                                    @"в переносном значении",
    //                                    @"полуостров",
    //                                    @"полиграфия",
    //                                    @"политический термин",
    //                                    @"пословица",
    //                                    @"поэтическое слово, выражение",
    //                                    @"превосходная степень",
    //                                    @"предложение",
    //                                    @"презрительно",
    //                                    @"преимущественно",
    //                                    @"пренебрежительно",
    //                                    @"приблизительно",
    //                                    @"имя прилагательное",
    //                                    @"психология",
    //                                    @"радиотехника",
    //                                    @"разговорное слово, выражение",
    //                                    @"в распространенном, неточном значении",
    //                                    @"редко",
    //                                    @"религия",
    //                                    @"смотри",
    //                                    @"собирательно",
    //                                    @"сокращение, сокращенно",
    //                                    @"специальный термин",
    //                                    @"физкультура и спорт",
    //                                    @"сравни",
    //                                    @"сравнительная степень",
    //                                    @"статистика",
    //                                    @"стилистика",
    //                                    @"стихосложение",
    //                                    @"строительное дело",
    //                                    @"студенческое слово, выражение",
    //                                    @"имя существительное",
    //                                    @"сельское хозяйство",
    //                                    @"творительный (падеж)",
    //                                    @"театральный термин",
    //                                    @"текстильное дело",
    //                                    @"техника",
    //                                    @"также",
    //                                    @"только",
    //                                    @"телевидение",
    //                                    @"топография",
    //                                    @"университетское выражение",
    //                                    @"употребляется",
    //                                    @"устаревшее слово, выражение",
    //                                    @"утвердительный",
    //                                    @"фармакология",
    //                                    @"физика",
    //                                    @"физиология",
    //                                    @"философия",
    //                                    @"финансовый термин",
    //                                    @"фонетика",
    //                                    @"фотография",
    //                                    @"французский (язык)",
    //                                    @"химия",
    //                                    @"хирургия",
    //                                    @"церковное слово, выражение",
    //                                    @"шахматы",
    //                                    @"шутливое слово, выражение",
    //                                    @"эвфемизм",
    //                                    @"экономика",
    //                                    @"электротехника",
    //                                    @"электроника",
    //                                    @"этнография",
    //                                    @"юридический термин",
    //                                    @"новозеланд"
    //                                    ];
    //
    //shortWords.dictionaryRusKeyShortObjLongProperty = [NSDictionary dictionaryWithObjects:shortWords.arrayLongRusProperty forKeys:shortWords.arrayShortRusProperty];
    //
    //

    //
    //аdj — adjective — имя прилагательное
    //adv — adverb — наречие
    //attr — attributive — атрибутивное употребление
    //сj — conjunction — союз
    //compar — comparative — сравнительная степень
    //emph — emphatic (pronoun) — усилительное (местои- мение)
    //imp — imperative — повелительное (наклонение) int — interjection — междометие
    //n — noun — имя существительное пит — numeral — числительное
    //part — particle — частица
    //pass — passive — страдательный (залог)
    //pl — plural — множественное число
    //р р — past participle — причастие прошедшего времени predic — predicative — предикативное употребление рrеf — prefix — приставка
    //prep — preposition — предлог
    //pres p — present participle — причастие настоящего вре-
    //мени
    //pron — pronoun — местоимение
    //refl — reflexive — употребляется с возвратным место- имением
    //sg — singular — единственное число smb — somebody — кто-л.
    //smth — something — что-л.
    //suff — suffix — суффикс
    //superl — superlative — превосходная степень v — verb — глагол

    //СПИСОК СОКРАЩЕНИЙ
    //Русские

    //ав — авиация
    //авт — автомобильное дело
    //амер — американизм
    //анат — анатомия
    //археол — археология
    //архит — архитектура
    //астр — астрономия
    //банк — банковский термин
    //без измен — без изменений
    //библ — библеизм
    //биол — биология
    //бот — ботаника
    //бухг — бухгалтерия
    //воен — военное дело
    //возвыш — возвышенно
    //вопр — вопросительный
    //вр — время
    //вчт — вычислительная техника
    //геогр — география
    //геод — геодезия
    //геол — геология
    //геом — геометрия
    //геральд — геральдика
    //гл — глагол
    //горн — горное дело
    //грам — грамматика
    //груб — грубое слово, выражение
    //д — дюйм
    //детск — детская речь
    //дип — дипломатия
    //дор — дорожное дело
    //др — другие
    //список сокращений
    //др-греч (ucm) — древнегреческий (-ая история)
    //др-евр — древнееврейский (язык)
    //др-рим (ист) — древнеримский (-ая история)
    //ед ч — единственное число
    //ж — женский род
    //ж-д — железнодорожный транспорт
    //жив — живопись
    //зоол — зоология
    //и пр — и прочее
    //ирон — в ироническом смысле, иронический
    //иск — искусство
    //ист — история
    //и т п — и тому подобное
    //канад — употребительно в Канаде
    //канц — канцелярское слово, выражение
    //карт — термин карточной игры
    //кино — кинематография
    //книжн — книжный стиль
    //ком — коммерческий термин
    //косм — космонавтика
    //кул — кулинария
    //л — лицо
    //-л — -либо
    //ласк — ласкательная форма
    //лат — латинский (язык)
    //лес — лесное дело
    //лингв — лингвистика
    //лит — литература, литературоведение
    //лог — логика
    //м — мужской род
    //мат — математика
    //мед — медицина
    //метал — металлургия
    //метео — метеорология
    //мех — механика
    //мин — минералогия
    //миф — мифология
    //мн ч — множественное число
    //мор — морской термин
    //муз — музыка
    //нареч — наречие
    //неизм — неизменяемая форма
    //неодобр — неодобрительно
    //о — остров
    //обыкн — обыкновенно
    //опт — оптика
    //особ — особенно
    //отриц — отрицательный
    //охот — охота
    //п — падеж
    //парл — парламентское выражение
    //перен — в переносном значении
    //п-ов — полуостров
    //полигр — полиграфия
    //полит — политический термин
    //посл — пословица
    //поэт — поэтическое слово, выражение
    //превосх ст — превосходная степень
    //предл — предложение
    //презр — презрительно
    //преим — преимущественно
    //пренебр — пренебрежительно
    //прибл — приблизительно
    //прил — имя прилагательное
    //психол — психология
    //радио — радиотехника
    //разг — разговорное слово, выражение
    //распр — в распространенном, неточном значении
    //редк — редко
    //рел — религия
    //см — смотри
    //собир — собирательно
    //сокр — сокращение, сокращенно
    //спец — специальный термин
    //спорт — физкультура и спорт
    //ср — сравни
    //сравн ст — сравнительная степень
    //стат — статистика
    //стил — стилистика
    //стих — стихосложение
    //стр — строительное дело
    //студ — студенческое слово, выражение
    //сущ — имя существительное
    //с-х — сельское хозяйство
    //твор — творительный (падеж)
    //театр — театральный термин
    //текст — текстильное дело
    //тех — техника
    //тж — также
    //тк — только
    //тлв — телевидение
    //топ — топография
    //унив — университетское выражение
    //употр — употребляется
    //уст — устаревшее слово, выражение
    //утв — утвердительный
    //фарм — фармакология
    //физ — физика
    //физиол — физиология
    //филос — философия
    //фин — финансовый термин
    //список сокращений
    //фон — фонетика
    //фото — фотография
    //фр — французский (язык)
    //хим — химия
    //хир — хирургия
    //церк — церковное слово, выражение
    //шахм — шахматы
    //шутл — шутливое слово, выражение
    //эвф — эвфемизм
    //эк — экономика
    //эл — электротехника
    //элн — электроника
    //этн — этнография
    //юр — юридический термин


